---
kind: method
id: M:Autodesk.Revit.DB.ParameterDownloadOptions.SetCategories(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
source: html/2ab9a6ae-905f-1f3a-a82d-743529c6557e.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions.SetCategories Method

Set categories for binding.

## Syntax (C#)
```csharp
public void SetCategories(
	ISet<ElementId> categories
)
```

## Parameters
- **categories** (`System.Collections.Generic.ISet < ElementId >`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null